{
  "backend/main.mo": "Main backend actor defining types (UserProfile, ApiCredentials, BotConfig with Grid/MACD-RSI/EMA strategies, TradeRecord, OrderRequest) and functions for user profile management, API credentials, bot configuration, trading history, and manual order execution with authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting implementation of three trading bots (Grid, MACD+RSI, EMA Scalping) and comprehensive dashboard with associated frontend files, components, test IDs, and high confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend TypeScript/TSX files covering routing, hooks, authentication, layout, pages, bot components, trading forms, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS variables for light and dark themes optimized for trading interface with deep backgrounds and accent colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Bitunix Trading Bot application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, dashboard, manual trading, and settings pages, wrapped in ThemeProvider with Header, ProfileSetupModal, and Toaster components.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component handling Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog forcing first-time users to create a profile with name (required) and email (optional) after Internet Identity authentication, preventing dismissal until completed.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route wrapper component that redirects unauthenticated users to landing page and shows loading spinner during identity initialization.",
  "frontend/src/components/bots/BotConfigDialog.tsx": "Dialog component with tabbed interface for configuring bot strategy (Grid/MACD-RSI/EMA) and risk management settings, rendering appropriate config form based on botType.",
  "frontend/src/components/bots/BotModeToggle.tsx": "A toggle switch component that allows users to switch a bot between automated and manual modes, updating the bot configuration via mutation and displaying toast notifications.",
  "frontend/src/components/bots/EmaScalpingBotConfig.tsx": "Configuration form for EMA scalping bot strategy with adjustable stop-loss and take-profit percentages using sliders, displaying strategy summary and risk/reward ratio.",
  "frontend/src/components/bots/GridBotConfig.tsx": "Configuration form for grid trading bot with inputs for upper/lower price bounds, grid levels, and investment per grid, displaying calculated price steps and total investment.",
  "frontend/src/components/bots/MacdRsiBotConfig.tsx": "Configuration form for MACD+RSI bot strategy with timeframe selection, leverage slider, and position size input, showing effective leveraged position size.",
  "frontend/src/components/bots/RiskManagementForm.tsx": "Form component for configuring bot risk management parameters including stop-loss, take-profit percentages, maximum position size, and daily loss limits with sliders and inputs.",
  "frontend/src/components/dashboard/BotCard.tsx": "Card component displaying bot metrics including profit/loss, trade count, open positions, and latest signal, with settings button to open configuration dialog and mode toggle.",
  "frontend/src/components/dashboard/RiskMetricsPanel.tsx": "Dashboard panel showing risk management overview with today's P/L, daily loss limit usage with progress bar, and open positions count calculated from trading history.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright information and a branded link to caffeine.ai with dynamic year and app identifier.",
  "frontend/src/components/layout/Header.tsx": "Header component with navigation menu (Dashboard, Manual Trading, Settings) that displays when authenticated, shows user profile name, and includes a login button.",
  "frontend/src/components/trading/ManualTradeForm.tsx": "Form component for placing manual spot or futures trades with configurable symbol, side (buy/sell or long/short), order type (market/limit), amount, price, and leverage settings.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useApiCredentials.ts": "Hook that wraps API credential queries (hasApiCredentials, saveApiCredentials, deleteApiCredentials) and returns their status and mutation functions.",
  "frontend/src/hooks/useBotMetrics.ts": "Hook that calculates bot performance metrics (profit/loss, trade count, open positions, latest signal) by combining bot configurations with trading history data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, bot configs, trading history, order placement, balance, and API credentials management.",
  "frontend/src/hooks/useUserProfile.ts": "Hook that wraps user profile queries and mutations, providing simplified access to current user profile data and save functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, chart colors, and sidebar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays bot metrics, risk metrics panel, and bot cards with refresh functionality. Shows loading state and handles empty bot configurations.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section showcasing three trading bot strategies (Grid, MACD+RSI, EMA Scalping) and feature cards. Redirects authenticated users to dashboard.",
  "frontend/src/pages/ManualTrading.tsx": "Manual trading interface with tabs for spot and futures trading, displays account balance and recent manual trade history. Includes trade execution forms for both market types.",
  "frontend/src/pages/Settings.tsx": "Settings page for managing Bitunix API credentials with save, test connection, and delete functionality. Includes secure input fields with show/hide toggles and connection status feedback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing. Includes sessionStorage persistence and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, and design tokens for UI components. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file defining a trading bot application for Bitunix exchange with three bots (spot grid, MACD/RSI futures, EMA scalping futures) and features including dashboard, manual/automated trading modes, and Internet Identity authentication. Contains architectural notes, existing features, known issues, and image requirements for the UI."
}