{
  "backend/main.mo": "Main actor defining trading bot backend with API credential management, user profiles, trading history, bot configurations (Grid, MACD+RSI, EMA Scalping), and access control with comprehensive credential validation.",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema, converting API credentials and user profiles to include new fields like isValid, enabledBotTypes, username, and nanosecond timestamps.",
  "feature_evidence.json": "Feature evidence report documenting fixes for API credential save crashes, error handling improvements, validation implementation, and loading state management in the Settings page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including hooks for queries, bot metrics, API credentials, auth components, pages (Dashboard, Settings, ManualTrading), and bot configuration dialogs.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables for UI components including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the Bitunix Trading Bot application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, dashboard, manual trading, and settings pages, wrapped in ThemeProvider with protected route guards.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to create one by entering a username and optional email. Prevents closing until profile is created.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to home page and shows a loading spinner during authentication initialization.",
  "frontend/src/components/bots/BotConfigDialog.tsx": "Dialog wrapper with tabs for strategy and risk management configuration, rendering the appropriate bot config form based on bot type (grid, macdRsi, or emaScalping).",
  "frontend/src/components/bots/BotModeToggle.tsx": "Switch component that toggles a bot between automated and manual modes, updating the backend configuration on change.",
  "frontend/src/components/bots/EmaScalpingBotConfig.tsx": "Configuration form for EMA scalping bot strategy with sliders for stop loss and take profit percentages, displaying strategy summary and risk/reward ratio.",
  "frontend/src/components/bots/GridBotConfig.tsx": "Configuration form for grid trading bot with inputs for upper/lower price bounds, grid levels, and investment per grid, showing calculated price steps and total investment.",
  "frontend/src/components/bots/MacdRsiBotConfig.tsx": "Configuration form for MACD+RSI bot with timeframe selection, leverage slider, and position size input, displaying effective position with leverage applied.",
  "frontend/src/components/bots/RiskManagementForm.tsx": "Form for configuring risk management parameters including stop loss, take profit percentages, maximum position size, and daily loss limit for any bot type.",
  "frontend/src/components/dashboard/BotCard.tsx": "Displays a card for a trading bot showing its name, type (Spot/Futures), active status, profit/loss metrics, trade count, and latest signal with a settings button to open configuration dialog.",
  "frontend/src/components/dashboard/RiskMetricsPanel.tsx": "Shows risk management metrics including today's profit/loss, daily loss limit with progress bar, and open positions count calculated from trading history.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with a caffeine.ai attribution link and copyright notice.",
  "frontend/src/components/layout/Header.tsx": "Navigation header with logo, authenticated navigation links (Dashboard, Manual Trading, Settings), user greeting, and login button.",
  "frontend/src/components/trading/ManualTradeForm.tsx": "Form component for placing manual spot or futures trades with fields for symbol, side (buy/sell or long/short), order type (market/limit), price, amount, and leverage (futures only).",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useApiCredentials.ts": "Aggregates API credential-related queries and mutations including checking existence, saving, deleting credentials, and fetching bot status.",
  "frontend/src/hooks/useBotMetrics.ts": "Calculates bot performance metrics (profit/loss, trade count, open positions, latest signal) by combining bot configurations with trading history data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API operations including user profiles, bot configs, trading history, balance, orders, and API credentials management.",
  "frontend/src/hooks/useUserProfile.ts": "Wrapper hook that combines user profile fetching and saving queries into a single convenient interface.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, including sidebar, chart, and component styling tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying bot metrics, risk panels, and bot cards with refresh functionality and loading states.",
  "frontend/src/pages/LandingPage.tsx": "Unauthenticated landing page showcasing three trading bot types with feature highlights and login button, redirecting authenticated users to dashboard.",
  "frontend/src/pages/ManualTrading.tsx": "Manual trading interface with spot/futures tabs, account balance display, trade form, and recent manual trades history table.",
  "frontend/src/pages/Settings.tsx": "Settings page component for managing Bitunix API credentials with validation, verification, and deletion functionality. Includes Persian error messages, credential visibility toggles, and connection status indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to store, retrieve, and clear parameters from URLs and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, sidebar theming, and chart colors. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing a trading bot application for Bitunix exchange with three bots (spot grid, MACD/RSI futures, EMA scalping futures). Lists known issues including React rendering errors and application crashes when saving API keys in Settings page."
}