{
  "kind": "build_request",
  "title": "Fix API credentials save error causing application crash",
  "projectName": "Bitunix Trading Bot",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Fix the application crash that occurs when users save Bitunix API credentials in the Settings page. The error 'خطای برنامه رخ داد' (Application error occurred) appears immediately after clicking Save, followed by a black screen with 'به مشکلی پیش اومد!' (A problem occurred). Implement proper error handling and validation to prevent crashes during API credential storage.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "بله از تنضیمات وارد میشم بله هنگام ساخت کلید گزینه ترید رو فعال کردم"
        ]
      },
      "acceptanceCriteria": [
        "Users can successfully save Bitunix API key and secret without application crash",
        "No 'خطای برنامه رخ داد' error appears after clicking Save button",
        "No black screen or 'به مشکلی پیش اومد!' message displays",
        "Application remains responsive and stable after saving credentials"
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add comprehensive error handling for API credential validation that catches all exceptions during the save operation. Display user-friendly error messages in Persian explaining what went wrong (e.g., invalid credentials format, network timeout, server error) instead of crashing the application.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ]
      },
      "acceptanceCriteria": [
        "Try-catch blocks wrap all API credential save operations",
        "Specific error messages display for different failure scenarios",
        "Error messages appear in Persian language",
        "Application recovers gracefully from errors without requiring page refresh"
      ]
    },
    {
      "id": "REQ-15",
      "text": "Implement API credential validation before saving to backend. Test the connection to Bitunix API using the provided credentials and verify that trading permissions are enabled before storing them. Display validation status to users.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "هنگام ساخت کلید گزینه ترید رو فعال کردم"
        ]
      },
      "acceptanceCriteria": [
        "Credentials are tested against Bitunix API before storage",
        "Trading permission verification occurs during validation",
        "Users see clear feedback about validation success or failure",
        "Invalid credentials are rejected with helpful error messages before saving"
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add loading states and proper async handling throughout the Settings page credential save flow. Prevent users from navigating away or submitting multiple times during the save operation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ]
      },
      "acceptanceCriteria": [
        "Loading spinner displays during credential save operation",
        "Save button is disabled while processing",
        "Users cannot navigate away during save operation",
        "Success confirmation appears after successful save"
      ]
    },
    {
      "id": "REQ-17",
      "text": "Review and fix the backend credential storage mechanism to ensure it properly handles API key and secret storage without throwing exceptions. Add validation to ensure credentials are properly formatted before attempting to store them.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-final"
        ]
      },
      "acceptanceCriteria": [
        "Backend accepts and stores valid API credentials without errors",
        "Backend validates credential format before storage",
        "Backend returns meaningful error codes for different failure scenarios",
        "Stored credentials can be successfully retrieved after saving"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add a success notification in Persian that displays when API credentials are successfully saved and validated. Include a 'Test Connection' button that users can click to verify their credentials are working correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ]
      },
      "acceptanceCriteria": [
        "Success toast notification appears in Persian after successful save",
        "Test Connection button is available on Settings page",
        "Test Connection button displays connection status (success/failure)",
        "Users receive clear feedback about their credentials status"
      ]
    }
  ],
  "constraints": [
    "Must not modify the existing Internet Identity authentication system",
    "Must preserve all existing bot configuration and trading history data",
    "Must maintain compatibility with Bitunix API structure",
    "Settings page must remain accessible only to authenticated users"
  ],
  "nonGoals": [
    "Redesigning the Settings page UI beyond error handling improvements",
    "Adding support for other exchanges besides Bitunix",
    "Implementing automatic API key rotation",
    "Adding multi-user credential management"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}