{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix API credentials save error causing application crash",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Fix application crash when saving Bitunix API credentials by implementing comprehensive error handling and validation throughout the save flow",
      "acceptanceCriteria": [
        "Users can successfully save Bitunix API key and secret without application crash",
        "No 'خطای برنامه رخ داد' error appears after clicking Save button",
        "No black screen or 'به مشکلی پیش اومد!' message displays",
        "Application remains responsive and stable after saving credentials"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Wrap the saveApiCredentials mutation call in comprehensive try-catch blocks. Add proper error boundary handling to prevent unhandled promise rejections. Implement state management to track save operation status (idle, loading, success, error) and prevent multiple simultaneous save attempts. Add validation before calling the backend mutation to ensure API key and secret are non-empty strings. Ensure loading states disable the Save button during processing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add error handling to the useSaveApiCredentials mutation hook. Configure the mutation to catch and transform backend errors into user-friendly error objects. Set retry: false to prevent automatic retries that could cause repeated failures. Add onError callback that logs detailed error information for debugging while preparing sanitized error messages for display."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add comprehensive error handling with Persian error messages for all API credential save failure scenarios",
      "acceptanceCriteria": [
        "Try-catch blocks wrap all API credential save operations",
        "Specific error messages display for different failure scenarios",
        "Error messages appear in Persian language",
        "Application recovers gracefully from errors without requiring page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Create an error message mapping function that translates backend error codes and exception types into Persian error messages. Handle specific scenarios: empty credentials ('لطفاً کلید API و رمز را وارد کنید'), network timeout ('خطای شبکه. لطفاً اتصال اینترنت خود را بررسی کنید'), invalid format ('فرمت کلید API نامعتبر است'), server error ('خطای سرور. لطفاً بعداً دوباره تلاش کنید'), and trading permission error ('دسترسی معاملاتی فعال نیست'). Use the Toaster component to display error messages. Ensure the component state resets properly after errors so users can retry without refreshing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Implement API credential validation with Bitunix API connection test and trading permission verification before storage",
      "acceptanceCriteria": [
        "Credentials are tested against Bitunix API before storage",
        "Trading permission verification occurs during validation",
        "Users see clear feedback about validation success or failure",
        "Invalid credentials are rejected with helpful error messages before saving"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Add a validation step before calling saveApiCredentials that first calls verifyApiCredentials backend capability with the entered credentials. Display a loading indicator during validation with Persian text 'در حال بررسی اعتبار...' (Validating credentials). If verification fails, show a Persian error message 'اعتبارسنجی ناموفق. کلیدها را بررسی کنید' (Validation failed. Check your keys) and do not proceed with saving. If verification succeeds, proceed with the save operation. Show validation status using an icon or badge next to the credentials fields."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useVerifyApiCredentials hook properly handles errors and returns validation status. Add detailed error information to help distinguish between network errors, authentication failures, and missing trading permissions."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add loading states and async handling to prevent navigation and duplicate submissions during credential save",
      "acceptanceCriteria": [
        "Loading spinner displays during credential save operation",
        "Save button is disabled while processing",
        "Users cannot navigate away during save operation",
        "Success confirmation appears after successful save"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Add isSaving state variable derived from the mutation's isPending status. Display a loading spinner (using existing UI components) next to the Save button when isSaving is true. Disable the Save button when isSaving is true or when credentials are empty. Add disabled={isSaving} to prevent form interactions during save. Use useEffect to show a blocking dialog or disable navigation when isSaving is true (optional: add beforeunload event listener). After successful save, display a success toast in Persian: 'اطلاعات با موفقیت ذخیره شد' (Information saved successfully)."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add success notification and Test Connection button for credential verification",
      "acceptanceCriteria": [
        "Success toast notification appears in Persian after successful save",
        "Test Connection button is available on Settings page",
        "Test Connection button displays connection status (success/failure)",
        "Users receive clear feedback about their credentials status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Add a 'Test Connection' button below the API credentials form that calls the verifyApiCredentials backend capability. When clicked, show loading state with Persian text 'در حال آزمایش اتصال...' (Testing connection). On success, display a success toast with Persian message 'اتصال موفق! اعتبار کلیدها تأیید شد' (Connection successful! Credentials verified) and show a green checkmark icon. On failure, display error toast with Persian message 'اتصال ناموفق. لطفاً کلیدها را بررسی کنید' (Connection failed. Please check your keys) and show a red X icon. After saveApiCredentials succeeds, automatically show the success toast notification. Include connection status indicators (colored badge or icon) next to the credentials section showing the last test result."
        }
      ]
    }
  ]
}